Revit 2027 API
BrowserOrganization.GetCurrentBrowserOrganizationForPanelSchedules Method
 Gets the BrowserOrganization that applies to the Panel Schedules section of the project browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BrowserOrganization GetCurrentBrowserOrganizationForPanelSchedules(
	Document document
)
Public Shared Function GetCurrentBrowserOrganizationForPanelSchedules (
	document As Document
) As BrowserOrganization
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForPanelSchedules(
	Document^ document
)
static member GetCurrentBrowserOrganizationForPanelSchedules :
        document : Document -> BrowserOrganization
Parameters
document Document
 Revit document from which to get the organization data.
Return Value
BrowserOrganization
 The BrowserOrganization for panel schedules, or null if no panel schedules sections exist.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace